// Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.
// 14212 -> нет
// 12821 -> да
// 23432 -> да

Console.WriteLine("Введите число: ");
int Number = Convert.ToInt32(Console.ReadLine()); 

void Numbers(int num);
if (num[1]=num[5] && num[3]=num[4])
{
    Console.WriteLine("Да, это палиндромом");
}
else
{
    Console.WriteLine("Нет, это не палиндромом");
}
Numbers(num);
